## Pandas 1
### Menyertakan Prefix dan Suffix pada seluruh kolom Data Frame.

In [4]:
import pandas as pd # mengimport modul pandas untuk membuat dataframe.
import numpy as np # mengimport modul numpy untuk menggunakan random integer.

print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

#### Persiapan Data Frame

In [5]:
n_rows =5 #jumlah baris
n_cols =5 #jumlah kolom
cols = tuple("ABCDE") #penamaan kolom
df = pd.DataFrame(np.random.randint(1,10, size=(n_rows, n_cols)),columns=cols)
df

   A  B  C  D  E
0  9  4  8  6  5
1  2  8  1  3  6
2  9  7  4  9  8
3  9  1  6  6  6
4  8  6  8  2  6

#### Menyertakan Prefix Kolom.

In [6]:
df.add_prefix("Kolom_") # prefix adalah label yang mendahului nama kolom.

   Kolom_A  Kolom_B  Kolom_C  Kolom_D  Kolom_E
0        9        4        8        6        5
1        2        8        1        3        6
2        9        7        4        9        8
3        9        1        6        6        6
4        8        6        8        2        6

#### Menyertakan Suffix Kolom.

In [7]:
df.add_suffix("_Field") # suffix adalah label yang ditambah pada nama kolom.

   A_Field  B_Field  C_Field  D_Field  E_Field
0        9        4        8        6        5
1        2        8        1        3        6
2        9        7        4        9        8
3        9        1        6        6        6
4        8        6        8        2        6

## Pandas 2

### Pemilihan baris (rows selection) pada Data Frame

In [8]:
# membentuk sebuah data frame yang berisi bilangan random 1-5
n_rows =10
n_cols =5
cols = tuple("ABCDE")
df2 = pd.DataFrame(np.random.randint(1,5, size=(n_rows, n_cols)),columns=cols)
df2

   A  B  C  D  E
0  4  1  3  3  1
1  3  1  1  3  3
2  2  4  1  2  1
3  2  1  4  4  4
4  2  2  3  1  1
5  3  2  3  2  1
6  4  2  1  4  2
7  4  3  4  3  1
8  2  1  1  3  4
9  2  4  3  1  1

#### Selection dengan operator logika | (OR)

In [9]:
df2[(df2["A"]==1) | (df2["A"]==3)] # melakukan seleksi baris yang memiliki nilai berupa angka 1 atau 3 pada kolom 'A', menggunakan operator logika 'OR'

   A  B  C  D  E
1  3  1  1  3  3
5  3  2  3  2  1

In [37]:
df2[(df2["B"]==1)] # Melakukan seleksi baris yang memiliki nilai berupa angka 1 pada kolom 'B'

   A  B  C  D  E
0  4  1  3  3  1
1  3  1  1  3  3
3  2  1  4  4  4
8  2  1  1  3  4

#### Selection dengan fungsi isin()

In [11]:
df2[df2["A"].isin([1,3])] # Melakukan seleksi baris yang memiliki nilai berupa angka 1 atau 3 pada kolom 'A', menggunakan function "isin"

   A  B  C  D  E
1  3  1  1  3  3
5  3  2  3  2  1

Mengenal operator negasi (~)

In [12]:
df2[~df2["A"].isin([1,3])] # Melakukan seleksi baris yang tidak memiliki nilai berupa angka 1 atau 3 pada kolom 'A', menggunakan operator negasi dan method 'isin'

   A  B  C  D  E
0  4  1  3  3  1
2  2  4  1  2  1
3  2  1  4  4  4
4  2  2  3  1  1
6  4  2  1  4  2
7  4  3  4  3  1
8  2  1  1  3  4
9  2  4  3  1  1

## Pandas 3

### Konversi tipe data String ke Numerik pada kolom Data Frame

#### Persiapan Data Frame

In [13]:
# Membuat data frame menggunakan dictionary.
data = {'col1':['1','2','3','teks'],
       'col2':['1','2','3','4'],
        'col3':['1','2','3','4']}
df3 = pd.DataFrame(data)
df3

   col1 col2 col3
0     1    1    1
1     2    2    2
2     3    3    3
3  teks    4    4

In [14]:
# Mengecek tipe data yang digunakan pada setiap kolom.
df3.dtypes

col1    object
col2    object
col3    object
dtype: object

#### Konversi tipe data dengan fungsi astype()

In [15]:
# Melakukan konversi tipe data menggunakan method 'astype', dengan parameter berupa nama kolom dan tipe data yang ingin diubah.
df_x = df3.astype({'col2':'int'})
df_x

   col1  col2 col3
0     1     1    1
1     2     2    2
2     3     3    3
3  teks     4    4

In [16]:
df_x.dtypes

col1    object
col2     int32
col3    object
dtype: object

#### Konversi tipe data numerik dengan fungsi to_numeric()

In [17]:
#Melakukan konversi tipe data semua data pada semua kolom menjadi numeric.
df3.apply(pd.to_numeric, errors="coerce") 
"""parameter error berfungsi untuk mengembalikan nilai 'NaN', ketika sebuah error terjadi akibat ketidaksesuaian tipe
data untuk di konversikan ke tipe data lainnya."""

   col1  col2  col3
0   1.0     1     1
1   2.0     2     2
2   3.0     3     3
3   NaN     4     4

## Pandas 4

### Pemilihan kolom (column selection) pada Data Frame berdasarkan tipe data.

#### Persiapan Data Frame

In [18]:
n_rows4 = 5
n_cols4 = 2
cols4 = ['bil_pecahan', 'bil_bulat']

df4 = pd.DataFrame(np.random.randint(1, 20, size =(n_rows4, n_cols4)), columns=cols4) 

df4['bil_pecahan'] = df4['bil_pecahan'].astype('float') # merubah tipe data pada data frame menjadi float.

df4.index = pd.util.testing.makeDateIndex(n_rows4, freq='H') # menambahkan kolom bernama index untuk menampilkan data berupa tanggal.
df4 = df4.reset_index()

df4['teks'] = list('ABCDE') # menambahkan kolom bernama teks untuk menampilkan data berupa string.
df4

C:\Users\ASUS\anaconda3\lib\site-packages\pandas\util\__init__.py:12: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00         19.0          4    A
1 2000-01-01 01:00:00         16.0         11    B
2 2000-01-01 02:00:00         11.0         12    C
3 2000-01-01 03:00:00          8.0         13    D
4 2000-01-01 04:00:00         16.0         16    E

#### Memilih kolom bertipe data numerik

In [19]:
df4.select_dtypes(include='number') # melakukan seleksi kolom tertentu yang memiliki tipe data angka (float atau integer).

   bil_pecahan  bil_bulat
0         19.0          4
1         16.0         11
2         11.0         12
3          8.0         13
4         16.0         16

In [20]:
df4.select_dtypes(include='float') # melakukan seleksi kolom tertentu yang memiliki tipe data float.

   bil_pecahan
0         19.0
1         16.0
2         11.0
3          8.0
4         16.0

In [21]:
df4.select_dtypes(include='int') # melakukan seleksi kolom tertentu yang memiliki tipe data int.

   bil_bulat
0          4
1         11
2         12
3         13
4         16

In [22]:
df4.select_dtypes(include='object') # melakukan seleksi kolom tertentu yang memiliki tipe data berupa object, dalam hal ini object yang ada adalah string.

  teks
0    A
1    B
2    C
3    D
4    E

In [23]:
df4.select_dtypes(include='datetime') # melakukan seleksi kolom tertentu yang memiliki tipe data berupa datetime.

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00

In [24]:
df4.select_dtypes(include=['number','object']) # melakukan seleksi kolom tertentu yang memiliki tipe data berupa object dan angka (Integer atau float).

   bil_pecahan  bil_bulat teks
0         19.0          4    A
1         16.0         11    B
2         11.0         12    C
3          8.0         13    D
4         16.0         16    E